#include<iostream>
using namespace std;

void main()
{
    setlocale(LC_ALL, "rus");
    int a = 0;
    double x = 0;
    cout << "Введите номер: "; cin >> a;
    cout << "Введите значение: "; cin >> x;
    switch (a)
    {
    case 1:
        cout << "Сторона: " << x << "\n"
            << "Радиус вписанной окружности: " << x / (2 * pow(3, 0.5)) << "\n"
            << "Радиус описанной окружности: " << x / pow(3, 0.5) << "\n"
            << "Площадь: " << (pow(3, 0.5) / 4) * pow(x, 2) << endl;
        break;
    case 2:
        cout << "Сторона: " << x * 2 * pow(3, 0.5) << "\n"
            << "Радиус вписанной окружности: " << x << "\n"
            << "Радиус описанной окружности: " << x * 2 << "\n"
            << "Площадь: " << (pow(3, 0.5) / 4) * pow(x * 2 * pow(3, 0.5), 2) << endl;
        break;
    case 3:
        cout << "Сторона: " << x * pow(3, 0.5) << "\n"
            << "Радиус вписанной окружности: " << x / 2 << "\n"
            << "Радиус описанной окружности: " << x  << "\n"
            << "Площадь: " << (pow(3, 0.5) / 4) * pow(x * pow(3, 0.5), 2) << endl;
        break;
    case 4:
        cout << "Сторона: " << pow((4 * x) / pow(3, 0.5), 0.5) << "\n"
            << "Радиус вписанной окружности: " << pow(x / (3 * pow(3, 0.5)), 0.5) << "\n"
            << "Радиус описанной окружности: " << pow((x * 4) / (3 * pow(3, 0.5)), 0.5) << "\n"
            << "Площадь: " << x << endl;
        break;
    default:
        cout << "Неверное число" << endl;
        break;
    }
    system("pause");
}